import os
os.environ.setdefault("DJANGO_SETTINGS_MODULE", "tutorial.settings")

import django
django.setup()

from quickstart.models import *

x = '''
학생회관 880-5543 학생회관(63동) 37.45932 126.95058,
전망대(농대) 880-5545 전망대(75-1동) 37.45647 126.94851,
두레미담 880-9358 전망대(75-1동) 37.45647 126.94851,
기숙사(919동) 881-9072 관악생활관(919동) 37.46306 126.95872,
기숙사(901동) 881-9201 관악생활관(901동) 37.46204 126.95782,
302동 880-1939 302동 37.44887 126.95265,
동원관 880-8697 113동 37.46504 126.95175,
자하연 880-7888 농협(109동) 37.46098 126.95252,
두레미담(주문식) 889-6946 76동 37.46073 126.9557,
서당골(사범대) 889-6946 76동 37.46073 126.9557,
301동 889-8955 301동 37.45016 126.95259,
301동(교수) 889-8955 301동 37.45016 126.95259,
예술계식당 876-1006 74동 37.46193 126.95312,
샤반 871-6933 501동 37.4592190840394 126.94812006718699,
공깡 889-8956 30-2동 37.45727 126.95079,
소담마루 880-8698 동원생활관(113동) 37.46504 126.95175,
220동 875-0240 3단계대학원연구동(220동) 37.46451 126.95424,
라운지오 882-7005 동원생활관(113동) 37.46504 126.95175,
감골식당 880-5544 아시아연구소(101동) 37.46328 126.95015
'''
l = [i.split(' ') for i in x.split(',')]
for i in l:
    x = [j.replace('\n', '') for j in i]
    
    name, n, location, lat, lng = x
    pnew = Restaurant(
        name = name,
        number = '02-' + n,
        location = location,
        lng = lng, lat = lat
    )
    pnew.save()
    print(pnew)